from flask import Flask, render_template, request
app = Flask(__name__)

subjects = [("スタートアップ・セミナー", 1),
            ("総合英語Ⅰa", 2),
            ("総合英語Ⅱb", 2),
            ("英語コミュニケーションa", 2),
            ("英語コミュニケーションb", 2),
            ("中国語Ⅰa", 2),
            ("中国語Ⅰb", 2),
            ("中国語Ⅱa", 2),
            ("中国語Ⅱb", 2),
            ("韓国語Ⅰa", 2),
            ("韓国語Ⅰb", 2),
            ("韓国語Ⅱa", 2),
            ("韓国語Ⅱb", 2),
            ("スペイン語Ⅰa ", 2),
            ("スペイン語Ⅰb ", 2),
            ("スペイン語Ⅱa", 2),
            ("スペイン語Ⅱb", 2),
            ("フランス語Ⅰa", 2),
            ("フランス語Ⅰb", 2),
            ("フランス語Ⅱa", 2),
            ("フランス語Ⅱb", 2),
            ("アカデミック・ジャパニーズ(Writing)", 2),
            ("アカデミック・ジャパニーズ(Reading)", 2),
            ("日本語A", 2),
            ("日本語B", 2),
            ("日本語C", 2),
            ("日本語D", 2),
            ("現代日本事情", 2),
            ("情報リテラシー", 2),
            ("生活と情報", 2),
            ("運動と人間 −講義", 2),
            ("運動と人間 −実技Ⅰ", 1),
            ("運動と人間 −実技Ⅱ", 1),
            ("運動と人間 −実技Ⅲ", 1),
            ("運動と人間 −実技Ⅳ", 1),
            ("生活と健康", 2),
            ("キャリアデザインⅠ", 2),
            ("キャリアデザインⅡ", 2),
            ("インターンシップ", 1),
            ("人間と思想", 2),
            ("人間と芸術 −美術", 2),
            ("人間と芸術 −音楽", 2),
            ("人間と芸術 −文学", 2),
            ("人間と文化", 2),
            ("人間と心", 2),
            ("人間と社会", 2),
            ("社会と歴史", 2),
            ("社会と政治", 2),
            ("社会と経済", 2),
            ("社会と法", 2),
            ("日本国憲法", 2),
            ("宇宙の科学", 2),
            ("生物の科学", 2),
            ("生活と科学", 2),
            ("モノづくりデザインの基礎", 2),
            ("環境論", 2),
            ("ジェンダー論", 2),
            ("グローバル化論", 2),
            ("山梨学Ⅰ", 2),
            ("山梨学Ⅱ", 2),
            ("日本語の方言と山梨", 2),
            ("プレゼンテーション", 2),
            ("グループワークと自己表現", 2),
            ("カウンセリング基礎", 2),
            ("発達と教育の心理", 2),
            ("国際関係論", 2),
            ("平和と安全保証", 2),
            ("文化とコミュニケーション", 2),
            ("情報社会論", 2),
            ("情報ネットワーク論", 2),
            ("留学英語", 1),
            ("共生社会論", 2),
            ("韓国学概論", 2),
            ("国際理解演習(韓国)", 4),
            ("ソーシャルデザイン入門", 2),
            ("地域ボランティア演習", 2),
            ("コミュニケーション基礎", 2),
            ("生と幸福", 2),
            ("生涯スポーツ", 2),
            ("リラクゼーション", 1),
            ("救急法", 1),
            ("災害支援", 1),
            ("国際協力", 1),
            ("自由科目", 4)]


@app.route('/form')
def form():
    return render_template('form.html', subjects=subjects)


@app.route('/confirm', methods=['POST', 'GET'])
def confirm():
    if request.method == 'POST':
        result = request.form
        sum_credits = 0
        app.logger.debug(result)
        for i, subject in enumerate(result):
            app.logger.debug(result[subject])
            if result[subject] == 'on':
                sum_credits += subjects[i][1]
        return render_template("confirm.html", result=result, credits=sum_credits)
    else:
        return "ばーか"


if __name__ == "__main__":
    app.run(host='0.0.0.0', debug=True)
